hariharan235/ARM-Cortex-M4F-Driver-Development/TM4C123-Drivers/inc/main_tm4c123gh6pm.h
/*
 * @brief IO definitions (access restrictions to peripheral registers), idea taken from ARM header file
 */
#define __I       volatile const       /*!< Defines 'read only' permissions    */
#define __O       volatile             /*!< Defines 'write only' permissions   */
#define __IO      volatile             /*!< Defines 'read / write' permissions */


/*
 * @brief Generic Bit Macro Definitions
 */
#define SET       1
#define RESET     0
#define ENABLE    SET
#define DISABLE   RESET
#define EN        ENABLE
#define DS        DISABLE


/***************************************************************************/
/*                                                                         */
/*                       Device Memory Map                                 */
/*                                                                         */
/***************************************************************************/


/*
 * @brief Base Addresses of Flash and SRAM memory
 */
#define FLASH_BASEADDR           0x00000000UL  /*!< FLASH (up to 256 KB) base address in the alias region */
#define SRAM_BASEADDR            0x20000000UL  /*!< SRAM (32 KB) base address in the alias region         */
#define SRAM_BB_BASEADDR         0x22000000UL  /*!< SRAM (32 KB) base address in the bit-band region      */


/*
 * @brief Peripheral Bus Base Addresses
 */
#define PERIPH_BASEADDR          0x40000000UL                      /*!< Peripheral base address in the alias region         */
#define PERIPH_BB_BASEADDR       (PERIPH_BASEADDR + 0x02000000UL)  /*!< Bit-banded alias of 0x4000.0000 through 0x400F.FFFF */
#define APBPERIPH_BASEADDR       PERIPH_BASEADDR                   /*!< Base address of Advanced Peripheral Bus             */
#define AHBPERIPH_BASEADDR       (PERIPH_BASEADDR + 0x00050000UL)  /*!< Base address of Advanced High Performance Bus       */


/*
 * @brief APB Peripherals Base Addresses
 * TODO add other peripherals
 */
#define WATCHDOG0_BASEADDR       (APBPERIPH_BASEADDR + 0x0000UL)      /*!< Base address of Watchdog timer 0        */
#define WATCHDOG1_BASEADDR       (APBPERIPH_BASEADDR + 0x1000UL)      /*!< Base address of Watchdog timer 1        */

#define GPIOA_BASEADDR           (APBPERIPH_BASEADDR + 0x4000UL)      /*!< Base address of GPIO Port A             */
#define GPIOB_BASEADDR           (APBPERIPH_BASEADDR + 0x5000UL)      /*!< Base address of GPIO Port B             */
#define GPIOC_BASEADDR           (APBPERIPH_BASEADDR + 0x6000UL)      /*!< Base address of GPIO Port C             */
#define GPIOD_BASEADDR           (APBPERIPH_BASEADDR + 0x7000UL)      /*!< Base address of GPIO Port D             */
#define GPIOE_BASEADDR           (APBPERIPH_BASEADDR + 0x00024000UL)  /*!< Base address of GPIO Port E             */
#define GPIOF_BASEADDR           (APBPERIPH_BASEADDR + 0x00025000UL)  /*!< Base address of GPIO Port F             */

#define SSI0_BASEADDR            (APBPERIPH_BASEADDR + 0x8000UL)      /*!< Base address of SSI0                    */
#define SSI1_BASEADDR            (APBPERIPH_BASEADDR + 0x9000UL)      /*!< Base address of SSI1                    */
#define SSI2_BASEADDR            (APBPERIPH_BASEADDR + 0xA000UL)      /*!< Base address of SSI2                    */
#define SSI3_BASEADDR            (APBPERIPH_BASEADDR + 0xB000UL)      /*!< Base address of SSI3                    */

#define UART0_BASEADDR           (APBPERIPH_BASEADDR + 0xC000UL)      /*!< Base address of UART0                   */
#define UART1_BASEADDR           (APBPERIPH_BASEADDR + 0xD000UL)      /*!< Base address of UART1                   */
#define UART2_BASEADDR           (APBPERIPH_BASEADDR + 0xE000UL)      /*!< Base address of UART2                   */
#define UART3_BASEADDR           (APBPERIPH_BASEADDR + 0xF000UL)      /*!< Base address of UART3                   */
#define UART4_BASEADDR           (APBPERIPH_BASEADDR + 0x00010000UL)  /*!< Base address of UART4                   */
#define UART5_BASEADDR           (APBPERIPH_BASEADDR + 0x00011000UL)  /*!< Base address of UART5                   */
#define UART6_BASEADDR           (APBPERIPH_BASEADDR + 0x00012000UL)  /*!< Base address of UART6                   */
#define UART7_BASEADDR           (APBPERIPH_BASEADDR + 0x00013000UL)  /*!< Base address of UART7                   */

#define I2C0_BASEADDR            (APBPERIPH_BASEADDR + 0x00020000UL)  /*!< Base address of I2C 0                   */
#define I2C1_BASEADDR            (APBPERIPH_BASEADDR + 0x00021000UL)  /*!< Base address of I2C 1                   */
#define I2C2_BASEADDR            (APBPERIPH_BASEADDR + 0x00022000UL)  /*!< Base address of I2C 2                   */
#define I2C3_BASEADDR            (APBPERIPH_BASEADDR + 0x00023000UL)  /*!< Base address of I2C 3                   */

#define SYSCTL_BASEADDR          (APBPERIPH_BASEADDR + 0x000FE000UL)  /*!< Base address of System Control Register */


/*
 * @brief AHB Peripherals Base Addresses
 */
#define USB_BASEADDR             (AHBPERIPH_BASEADDR + 0x0000UL)  /*!< Base address of USB                        */
#define GPIOA_AHB_BASEADDR       (AHBPERIPH_BASEADDR + 0x8000UL)  /*!< Base address of GPIO Port A (AHB aperture) */
#define GPIOB_AHB_BASEADDR       (AHBPERIPH_BASEADDR + 0x9000UL)  /*!< Base address of GPIO Port B (AHB aperture) */
#define GPIOC_AHB_BASEADDR       (AHBPERIPH_BASEADDR + 0xA000UL)  /*!< Base address of GPIO Port C (AHB aperture) */
#define GPIOD_AHB_BASEADDR       (AHBPERIPH_BASEADDR + 0xB000UL)  /*!< Base address of GPIO Port D (AHB aperture) */
#define GPIOE_AHB_BASEADDR       (AHBPERIPH_BASEADDR + 0xC000UL)  /*!< Base address of GPIO Port E (AHB aperture) */
#define GPIOF_AHB_BASEADDR       (AHBPERIPH_BASEADDR + 0xD000UL)  /*!< Base address of GPIO Port F (AHB aperture) */



/*
 * @brief Base Addresses of Core Peripherals
 */
#define COREPERIPH_BASEADDR      0xE000E000UL                      /*!< Processor Core Peripheral base address */
#define SYSTIC_BASEADDR          (COREPERIPH_BASEADDR + 0x0010UL)  /*!< SysTick Base Address                   */
#define NVIC_BASEADDR            (COREPERIPH_BASEADDR + 0x0100UL)  /*!< NVIC Base Address                      */




/***************************************************************************/
/*                                                                         */
/*                 Device Specific Data Structure Section                  */
/*                                                                         */
/***************************************************************************/


