hariharan235/ARM-Cortex-M4F-Driver-Development/TM4C123-Drivers/inc/main_tm4c123gh6pm.h
/*
 * @brief Cortex M-4 Processor Core Peripheral Register
 */

typedef struct
{
    __IO uint32_t EN0;             /*!< Interrupt 0-31 Set Enable,        Address offset: 0x100 */
    __IO uint32_t EN1;             /*!< Interrupt 32-63 Set Enable,       Address offset: 0x104 */
    __IO uint32_t EN2;             /*!< Interrupt 64-95 Set Enable,       Address offset: 0x108 */
    __IO uint32_t EN3;             /*!< Interrupt 96-127 Set Enable,      Address offset: 0x10C */
    __IO uint32_t EN4;             /*!< Interrupt 128-138 Set Enable,     Address offset: 0x110 */
    __IO uint32_t RESERVED[27];    /*!< RESERVED,                         Address offset: 0x17C */
    __IO uint32_t DISO;            /*!< Interrupt 0-31 Clear Enable,      Address offset: 0x180 */
    __IO uint32_t DIS1;            /*!< Interrupt 32-63 Clear Enable,     Address offset: 0x184 */
    __IO uint32_t DIS2;            /*!< Interrupt 64-95 Clear Enable,     Address offset: 0x188 */
    __IO uint32_t DIS3;            /*!< Interrupt 96-127 Clear Enable,    Address offset: 0x18C */
    __IO uint32_t DIS4;            /*!< Interrupt 128-138 Clear Enable,   Address offset: 0x190 */
    __IO uint32_t RESERVED1[27];   /*!< RESERVED,                         Address offset: 0x1FC */
    __IO uint32_t PENDO;           /*!< Interrupt 0-31 Set Pending,       Address offset: 0x200 */
    __IO uint32_t PEND1;           /*!< Interrupt 32-63 Set Pending,      Address offset: 0x204 */
    __IO uint32_t PEND2;           /*!< Interrupt 64-95 Set Pending,      Address offset: 0x208 */
    __IO uint32_t PEND3;           /*!< Interrupt 96-127 Set Pending,     Address offset: 0x20C */
    __IO uint32_t PEND4;           /*!< Interrupt 128-138 Set Pending,    Address offset: 0x210 */
    __IO uint32_t RESERVED2[27];   /*!< RESERVED,                         Address offset: 0x280 */
    __IO uint32_t UNPENDO;         /*!< Interrupt 0-31 Clear Pending,     Address offset: 0x280 */
    __IO uint32_t UNPEND1;         /*!< Interrupt 32-63 Clear Pending,    Address offset: 0x284 */
    __IO uint32_t UNPEND2;         /*!< Interrupt 64-95 Clear Pending,    Address offset: 0x288 */
    __IO uint32_t UNPEND3;         /*!< Interrupt 96-127 Clear Pending,   Address offset: 0x28C */
    __IO uint32_t UNPEND4;         /*!< Interrupt 128-138 Clear Pending,  Address offset: 0x290 */
    __IO uint32_t RESERVED3[27];   /*!< RESERVED,                         Address offset: 0x2FC */
    __IO uint32_t ACTIVE0;         /*!< Interrupt 0-31 Active Bit,        Address offset: 0x300 */
    __IO uint32_t ACTIVE1;         /*!< Interrupt 32-63 Active Bit,       Address offset: 0x304 */
    __IO uint32_t ACTIVE2;         /*!< Interrupt 64-95 Active Bit,       Address offset: 0x308 */
    __IO uint32_t ACTIVE3;         /*!< Interrupt 96-127 Active Bit,      Address offset: 0x30C */
    __IO uint32_t ACTIVE4;         /*!< Interrupt 128-138 Active Bit,     Address offset: 0x310 */
    __IO uint32_t RESERVED4[59];   /*!< RESERVED,                         Address offset: 0x3FC */
    __IO uint32_t PRIO;            /*!< Interrupt 0-3 Priority,           Address offset: 0x400 */
    __IO uint32_t PRI1;            /*!< Interrupt 4-7 Priority,           Address offset: 0x404 */
    __IO uint32_t PRI2;            /*!< Interrupt 8-11 Priority,          Address offset: 0x408 */
    __IO uint32_t PRI3;            /*!< Interrupt 12-15 Priority,         Address offset: 0x40C */
    __IO uint32_t PRI4;            /*!< Interrupt 16-19 Priority,         Address offset: 0x410 */
    __IO uint32_t PRI5;            /*!< Interrupt 20-23 Priority,         Address offset: 0x414 */
    __IO uint32_t PRI6;            /*!< Interrupt 24-27 Priority,         Address offset: 0x418 */
    __IO uint32_t PRI7;            /*!< Interrupt 28-31 Priority,         Address offset: 0x41C */
    __IO uint32_t PRI8;            /*!< Interrupt 32-35 Priority,         Address offset: 0x420 */
    __IO uint32_t PRI9;            /*!< Interrupt 36-39 Priority,         Address offset: 0x424 */
    __IO uint32_t PRI1O;           /*!< Interrupt 40-43 Priority,         Address offset: 0x428 */
    __IO uint32_t PRI11;           /*!< Interrupt 44-47 Priority,         Address offset: 0x42C */
    __IO uint32_t PRI12;           /*!< Interrupt 48-51 Priority,         Address offset: 0x430 */
    __IO uint32_t PRI13;           /*!< Interrupt 52-55 Priority,         Address offset: 0x434 */
    __IO uint32_t PRI14;           /*!< Interrupt 56-59 Priority,         Address offset: 0x438 */
    __IO uint32_t PRI15;           /*!< Interrupt 60-63 Priority,         Address offset: 0x43C */
    __IO uint32_t PRI16;           /*!< Interrupt 64-67 Priority,         Address offset: 0x440 */
    __IO uint32_t PRI17;           /*!< Interrupt 68-71 Priority,         Address offset: 0x444 */
    __IO uint32_t PRI18;           /*!< Interrupt 72-75 Priority,         Address offset: 0x448 */
    __IO uint32_t PRI19;           /*!< Interrupt 76-79 Priority,         Address offset: 0x44C */
    __IO uint32_t PRI20;           /*!< Interrupt 80-83 Priority,         Address offset: 0x450 */
    __IO uint32_t PRI21;           /*!< Interrupt 84-87 Priority,         Address offset: 0x454 */
    __IO uint32_t PRI22;           /*!< Interrupt 88-91 Priority,         Address offset: 0x458 */
    __IO uint32_t PRI23;           /*!< Interrupt 92-95 Priority,         Address offset: 0x45C */
    __IO uint32_t PRI24;           /*!< Interrupt 96-99 Priority,         Address offset: 0x460 */
    __IO uint32_t PRI25;           /*!< Interrupt 100-103 Priority,       Address offset: 0x464 */
    __IO uint32_t PRI26;           /*!< Interrupt 104-107 Priority,       Address offset: 0x468 */
    __IO uint32_t PRI27;           /*!< Interrupt 108-111 Priority,       Address offset: 0x46C */
    __IO uint32_t PRI28;           /*!< Interrupt 112-115 Priority,       Address offset: 0x470 */
    __IO uint32_t PRI29;           /*!< Interrupt 116-119 Priority,       Address offset: 0x474 */
    __IO uint32_t PRI30;           /*!< Interrupt 120-123 Priority,       Address offset: 0x478 */
    __IO uint32_t PRI31;           /*!< Interrupt 124-127 Priority,       Address offset: 0x47C */
    __IO uint32_t PRI32;           /*!< Interrupt 128-131 Priority,       Address offset: 0x480 */
    __IO uint32_t PRI33;           /*!< Interrupt 132-135 Priority,       Address offset: 0x484 */
    __IO uint32_t PRI34;           /*!< Interrupt 136-138 Priority,       Address offset: 0x488 */
    __IO uint32_t RESERVED5[669];  /*!< RESERVED,                         Address offset: 0xEFC */
    __IO uint32_t SWTRIG;          /*!< Software Trigger Interrupt,       Address offset: 0xF00 */

} NVIC_T;



