hariharan235/ARM-Cortex-M4F-Driver-Development/TM4C123-Drivers/inc/main_tm4c123gh6pm.h
/*
 * @brief General-Purpose Input/Outputs
 * TODO complete Address offsets
 */
typedef struct
{
    __I  uint32_t BITMASK[255];  /*!< GPIO [9:2] register mask space, see Data Sheet,  Address offset: 0x3FC */
    __IO uint32_t DATA;          /*!< GPIO Data,                                       Address offset: 0x400 */
    __IO uint32_t DIR;           /*!< GPIO Direction,                                  Address offset: 0x404 */
    __IO uint32_t IS;            /*!< GPIO Interrupt Sense,                            Address offset: 0x408 */
    __IO uint32_t IBE;           /*!< GPIO Interrupt Both Edges,                       Address offset: 0x40C */
    __IO uint32_t IEV;           /*!< GPIO Interrupt Event,                            Address offset: 0x410 */
    __IO uint32_t IM;            /*!< GPIO Interrupt Mask,                             Address offset: 0x414 */
    __IO uint32_t RIS;           /*!< GPIO Raw Interrupt Status,                       Address offset: 0x418 */
    __IO uint32_t MIS;           /*!< GPIO Masked Interrupt Status,                    Address offset: 0x41C */
    __O  uint32_t ICR;           /*!< GPIO Interrupt Clear,                            Address offset: 0x420 */
    __IO uint32_t AFSEL;         /*!< GPIO Alternate Function Select,                  Address offset: 0x400 */
    __I  uint32_t RESERVED[55];  /*!< RESERVED,                                        Address offset: 0x000 */
    __IO uint32_t DR2R;          /*!< GPIO 2-mA Drive Select,                          Address offset: 0x000 */
    __IO uint32_t DR4R;          /*!< GPIO 4-mA Drive Select,                          Address offset: 0x000 */
    __IO uint32_t DR8R;          /*!< GPIO 8-mA Drive Select,                          Address offset: 0x000 */
    __IO uint32_t ODR;           /*!< GPIO Open Drain Select,                          Address offset: 0x000 */
    __IO uint32_t PUR;           /*!< GPIO Pull-Up Select,                             Address offset: 0x000 */
    __IO uint32_t PDR;           /*!< GPIO Pull-Down Select,                           Address offset: 0x000 */
    __IO uint32_t SLR;           /*!< GPIO Slew Rate Control Select,                   Address offset: 0x000 */
    __IO uint32_t DEN;           /*!< GPIO Digital Enable,                             Address offset: 0x000 */
    __IO uint32_t LOCK;          /*!< GPIO Lock,                                       Address offset: 0x000 */
    __IO uint32_t CR;            /*!< GPIO Commit,                                     Address offset: 0x000 */
    __IO uint32_t AMSEL;         /*!< GPIO Analog Mode Select,                         Address offset: 0x000 */
    __IO uint32_t PCTL;          /*!< GPIO Port Control,                               Address offset: 0x000 */
    __IO uint32_t ADCCTL;        /*!< GPIO ADC Control,                                Address offset: 0x000 */
    __IO uint32_t DMACTL;        /*!< GPIO DMA Control,                                Address offset: 0x000 */

} GPIO_PORT_T;


/*
 * @brief Serial Peripheral Interface Registers
 *
 */

typedef struct
{
    __IO uint32_t CR0;    /*!< SSI Control 0                                        Address offset: 0x000 */
    __IO uint32_t CR1;    /*!< SSI Control 1                                     Address offset: 0x004 */
    __IO uint32_t DR;    /*!< SSI Data Register                                  Address offset: 0x008 */
    __I uint32_t SR;    /*!< SSI Status Register                                Address offset: 0x00C */
    __IO uint32_t CPSR;   /*!< SSI Clock Pre-scale                                              Address offset: 0x0010 */
    __IO uint32_t IM;    /*!< SSI Interrupt Mask                                 Address offset: 0x0014 */
    __I uint32_t RIS;   /*!< SSI Raw Interrupt Status                           Address offset: 0x0018 */
    __I uint32_t MIS;   /*!< SSI Masked Interrupt Status                         Address offset: 0x001C */
    __O uint32_t ICR;   /*!< SSI Interrupt Clear,                             Address offset: 0x0020 */
    __IO uint32_t DMACTL; /*!< SSI DMA Control,                                Address offset: 0x0024 */
    __I  uint32_t RESERVED[1000];  /*!< RESERVED,                                Address offset: 0x0028 */
    __IO uint32_t CC;     /*!< SSI Clock Configuration                         Address offset: 0x0FC8 */


}ssi_periph_t;

/***************************************************************************/
/*                                                                         */
/*                       Device Peripheral Definitions                     */
/*                                                                         */
/***************************************************************************/


/*
 * @brief Peripheral Declarations
 */
#define GPIOA                    ((GPIO_PORT_T *) GPIOA_BASEADDR)
#define GPIOB                    ((GPIO_PORT_T *) GPIOB_BASEADDR)
#define GPIOC                    ((GPIO_PORT_T *) GPIOC_BASEADDR)
#define GPIOD                    ((GPIO_PORT_T *) GPIOD_BASEADDR)
#define GPIOE                    ((GPIO_PORT_T *) GPIOE_BASEADDR)
#define GPIOF                    ((GPIO_PORT_T *) GPIOF_BASEADDR)

#define GPIOA_AHB                ((GPIO_PORT_T *) GPIOA_AHB_BASEADDR)
#define GPIOB_AHB                ((GPIO_PORT_T *) GPIOB_AHB_BASEADDR)
#define GPIOC_AHB                ((GPIO_PORT_T *) GPIOC_AHB_BASEADDR)
#define GPIOD_AHB                ((GPIO_PORT_T *) GPIOD_AHB_BASEADDR)
#define GPIOE_AHB                ((GPIO_PORT_T *) GPIOE_AHB_BASEADDR)
#define GPIOF_AHB                ((GPIO_PORT_T *) GPIOF_AHB_BASEADDR)

#define SSI0                     ((ssi_periph_t *) SSI0_BASEADDR)
#define SSI1                     ((ssi_periph_t *) SSI1_BASEADDR)
#define SSI2                     ((ssi_periph_t *) SSI2_BASEADDR)
#define SSI3                     ((ssi_periph_t *) SSI3_BASEADDR)

#define SYSCTL                   ((SYSCTL_T        *)SYSCTL_BASEADDR)
#define SYSCTL_LEGACY            ((SYSCTL_LEGACY_T *)SYSCTL_BASEADDR)


#define NVIC                     ((NVIC_T          *)NVIC_BASEADDR)



#endif /* MAIN_TM4C123GH6PM_H_ */
